In [4]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame([[1, np.nan, 1], [np.nan, 4,], [np.nan, 6,], [7, np.nan,]], columns=["A", "B", "AorB"])

In [2]:
df1['D'] = np.nan

In [3]:
df1

     A    B  AorB   D
0  1.0  NaN   1.0 NaN
1  NaN  4.0   NaN NaN
2  NaN  6.0   NaN NaN
3  7.0  NaN   NaN NaN

In [4]:
df2 = pd.DataFrame(columns=['A','B','C'])

In [5]:
df2

Empty DataFrame
Columns: [A, B, C]
Index: []

In [30]:
import pandas as pd
import numpy as np

df = pd.DataFrame([[1,1,1],[1,1,np.nan],[1,1,np.nan],[2,2,np.nan],[2,2,np.nan],[2,2,2],[3,3,np.nan],[3,3,np.nan]], columns=['a','b','c'])

for k,v in df.groupby(['a','b'])['c']:
    print(k)
    print(v.dropna())

print(df.groupby(['a','b'])['c'].transform(lambda x: x.dropna() if x.notnull().any() else np.nan))
df['c'] = df.groupby(['a','b'])['c'].transform(lambda x: x.dropna() if x.notnull().any() else np.nan)
df

(1, 1)
0    1.0
Name: c, dtype: float64
(2, 2)
5    2.0
Name: c, dtype: float64
(3, 3)
Series([], Name: c, dtype: float64)
0    1.0
1    1.0
2    1.0
3    2.0
4    2.0
5    2.0
6    NaN
7    NaN
Name: c, dtype: float64

   a  b    c
0  1  1  1.0
1  1  1  1.0
2  1  1  1.0
3  2  2  2.0
4  2  2  2.0
5  2  2  2.0
6  3  3  NaN
7  3  3  NaN